app/views/codes/index.html.erb


                    <% if !code.registers.last.nil? %>
---
SELECT  `registers`.* FROM `registers`  WHERE `registers`.`code_id` = 1  ORDER BY `registers`.`id` DESC LIMIT 1


                           code.registers.each  do |registro|
---
SELECT `registers`.* FROM `registers`  WHERE `registers`.`code_id` = 1