app/controllers/codes_controller.rb

SELECT  `codes`.* FROM `codes`  LIMIT 25 OFFSET 0
---
  def index

    if !params[:codigo].nil?
      if params[:codigo] != ''
        @codes = Code.all.where('code'=>params[:codigo])

      else
        @codes = Code.all.page

SELECT  `codes`.* FROM `codes`  WHERE `codes`.`code` = '165136299198' LIMIT 1
SELECT `registers`.* FROM `registers`  WHERE `registers`.`code_id` = 1
---
  def consulta
    @code = Code.find_by_code(params[:code]);

    if @code.blank?

      data = [
          'blank'=> '-1'
      ]

    else



      @minutes = 0
      @code.registers.each do |register|

SELECT  `codes`.* FROM `codes`  WHERE `codes`.`code` = '165136299198' LIMIT 1
INSERT INTO `registers` (`code_id`, `created_at`, `idioma`, `time`, `updated_at`) VALUES (1, '2015-08-05 16:44:30', 1, 13, '2015-08-05 16:44:30')
---
  def adduse

    @id = Code.find_by_code(params[:code])



    time = params[:time]
    idioma = params[:idioma]
    code = Register.new()

    code.code_id = @id.id
    code.time = time
    code.idioma = idioma



    if time.to_i > 1

      if code.save