app/controllers/phones_controller.rb

SELECT `phones`.* FROM `phones`  WHERE `phones`.`language_id` = 1
SELECT  `languages`.* FROM `languages`  WHERE `languages`.`id` = 1 LIMIT 1
---
  def index

    @phones = Phone.where(:language_id=>params[:language_id]).all
    @language = Language.find_by_id(params[:language_id])

SELECT  `languages`.* FROM `languages`  WHERE `languages`.`id` = 1 LIMIT 1
---
  def new


    @language = Language.find_by_id(params[:language_id])

INSERT INTO `phones` (`created_at`, `language_id`, `name`, `phone`, `updated_at`) VALUES ('2015-07-09 18:25:35', 1, 'Alejandro', '1234567', '2015-07-09 18:25:35')
---
  def create


    @phone = Phone.new(allowed_params)
    @phone.language_id = params[:language_id]
    if @phone.save